{
"What is the lowest commitment pricing model for EC2, with low costs and a pay-as-you-go model?": "On-Demand",
"How is the On-Demand pricing model paid?": "Per second or per hour, with a full hour charge for all other instance types.",
"Which operating systems does the On-Demand model support?": "Linux, Windows, and Windows with SQL.",
"When is the On-Demand model suitable?": "For short-term and unpredictable workloads, first-time apps, and when interruptions cannot be tolerated.",
"What is the biggest savings pricing model for EC2?": "Spot, with up to 90% savings compared to On-Demand.",
"How does the Spot model work?": "It requests spare computing capacity, with flexible start and end times, and can handle interruptions.",
"When is the Spot model suitable?": "For non-critical background jobs that are not constantly in use.",
"What is the best long-term pricing model, offering up to 75% savings compared to On-Demand?": "Reserved Instances.",
"What factors determine the pricing of Reserved Instances?": "Term, class offering, RI attributes, and payment option.",
"How does the term of a Reserved Instance affect pricing?": "Longer terms offer greater savings, with a change to On-Demand pricing when the contract expires.",
"What is the difference between Standard and Convertible class offerings for Reserved Instances?": "Standard is the cheapest but less flexible, while Convertible allows for exchanging RIs based on RI attributes.",
"Which payment options for Reserved Instances offer the greatest savings?": "All Upfront, Partial Upfront, and No Upfront, with varying levels of upfront payment and discounted hourly rates.",
"What are the RI attributes that can be modified?": "Instance type, region, tenancy, and platform (OS).",
"What is the scope of a Regional Reserved Instance?": "It is purchased for a specific region.",
"What is the scope of a Zonal Reserved Instance?": "It is purchased for a specific availability zone.",
"What are the limits for Reserved Instances per month?": "20 Regional Reserved Instances per region and 20 Zonal Reserved Instances per AZ.",
"Can Reserved Instances be interconnected with On-Demand Instances?": "Yes, they can run an on-demand instance for each zonal reserved instance.",
"What is the RI Marketplace?": "It allows for selling unused standard RIs after 30 days of activity.",
"What is the most expensive EC2 pricing model, offering dedicated servers?": "Dedicated Instances.",
"What are the tenancy options for Dedicated Instances?": "Multi-tenant, where everyone shares the same physical server, and single-tenant, where each user has their own physical server.",
"When is the Dedicated Instance model suitable?": "For guaranteeing isolated hardware, typically for enterprise use cases.",
"What are the types of Saving Plans available in EC2?": "Compute Savings Plan, EC2 Instance Savings Plan, and SageMaker Savings Plan.",
"Which Saving Plan offers the most flexibility?": "Compute Savings Plan, as it adds savings to all instances.",
"Which Saving Plan restricts savings to a specific instance family within a region?": "EC2 Instance Savings Plan."
}